Autodesk.Revit.DB.SlabShapeEditor.CreateCreasesFromFoldingLines(Autodesk.Revit.DB.Element,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Convert selected folding lines to split lines
hostObj:
object that hosts the SlabShapeEditor
references:
References of selected folding lines.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2023

Autodesk.Revit.DB.SlabShapeEditor.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SlabShapeEditor
An object used for Slab Shape Editing.
Remarks:
The SlabShapeEditor can be obtained from a slab object, such as a roof or floor.